Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ2048EFG064.atdf
      <value-group caption="Channel Abort IRQ Enable bit" name="DCH3ECON__AIRQEN">
         <value caption="Channel transfer is aborted if an interrupt matching CHAIRQ occurs" name="" value="0x1"/>
         <value caption="Interrupt number CHAIRQ is ignored and does not terminate a transfer" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Start IRQ Enable bit" name="DCH3ECON__SIRQEN">
         <value caption="Start channel cell transfer if an interrupt matching CHSIRQ occurs" name="" value="0x1"/>
         <value caption="Interrupt number CHSIRQ is ignored and does not start a transfer" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Pattern Match Abort Enable bit" name="DCH3ECON__PATEN">
         <value caption="Abort transfer and clear CHEN on pattern match" name="" value="0x1"/>
         <value caption="Pattern match is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Abort Transfer bit" name="DCH3ECON__CABORT">
         <value caption="A DMA transfer is aborted when this bit is written to a 1" name="" value="0x1"/>
         <value caption="This bit always reads 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Forced Transfer bit" name="DCH3ECON__CFORCE">
         <value caption="A DMA transfer is forced to begin when this bit is written to a 1" name="" value="0x1"/>
         <value caption="This bit always reads 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Transfer Start IRQ bits" name="DCH3ECON__CHSIRQ">
         <value caption="Interrupt 255 will initiate a DMA transfer" name="" value="0xff"/>
         <value caption="Interrupt 1 will initiate a DMA transfer" name="" value="0x1"/>
         <value caption="Interrupt 0 will initiate a DMA transfer" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Transfer Abort IRQ bits" name="DCH3ECON__CHAIRQ">
         <value caption="Interrupt 255 will abort any transfers in progress and set CHAIF flag" name="" value="0xff"/>
         <value caption="Interrupt 1 will abort any transfers in progress and set CHAIF flag" name="" value="0x1"/>
         <value caption="Interrupt 0 will abort any transfers in progress and set CHAIF flag" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Abort IRQ Enable bit" name="DCH4ECON__AIRQEN">
         <value caption="Channel transfer is aborted if an interrupt matching CHAIRQ occurs" name="" value="0x1"/>
         <value caption="Interrupt number CHAIRQ is ignored and does not terminate a transfer" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Start IRQ Enable bit" name="DCH4ECON__SIRQEN">
         <value caption="Start channel cell transfer if an interrupt matching CHSIRQ occurs" name="" value="0x1"/>
         <value caption="Interrupt number CHSIRQ is ignored and does not start a transfer" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Pattern Match Abort Enable bit" name="DCH4ECON__PATEN">
         <value caption="Abort transfer and clear CHEN on pattern match" name="" value="0x1"/>
         <value caption="Pattern match is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Abort Transfer bit" name="DCH4ECON__CABORT">
         <value caption="A DMA transfer is aborted when this bit is written to a 1" name="" value="0x1"/>
         <value caption="This bit always reads 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Forced Transfer bit" name="DCH4ECON__CFORCE">
         <value caption="A DMA transfer is forced to begin when this bit is written to a 1" name="" value="0x1"/>
         <value caption="This bit always reads 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Transfer Start IRQ bits" name="DCH4ECON__CHSIRQ">
         <value caption="Interrupt 255 will initiate a DMA transfer" name="" value="0xff"/>
         <value caption="Interrupt 1 will initiate a DMA transfer" name="" value="0x1"/>
         <value caption="Interrupt 0 will initiate a DMA transfer" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Transfer Abort IRQ bits" name="DCH4ECON__CHAIRQ">
         <value caption="Interrupt 255 will abort any transfers in progress and set CHAIF flag" name="" value="0xff"/>
         <value caption="Interrupt 1 will abort any transfers in progress and set CHAIF flag" name="" value="0x1"/>
         <value caption="Interrupt 0 will abort any transfers in progress and set CHAIF flag" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Abort IRQ Enable bit" name="DCH5ECON__AIRQEN">
         <value caption="Channel transfer is aborted if an interrupt matching CHAIRQ occurs" name="" value="0x1"/>
         <value caption="Interrupt number CHAIRQ is ignored and does not terminate a transfer" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Start IRQ Enable bit" name="DCH5ECON__SIRQEN">
         <value caption="Start channel cell transfer if an interrupt matching CHSIRQ occurs" name="" value="0x1"/>
         <value caption="Interrupt number CHSIRQ is ignored and does not start a transfer" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Pattern Match Abort Enable bit" name="DCH5ECON__PATEN">
         <value caption="Abort transfer and clear CHEN on pattern match" name="" value="0x1"/>
         <value caption="Pattern match is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Abort Transfer bit" name="DCH5ECON__CABORT">
         <value caption="A DMA transfer is aborted when this bit is written to a 1" name="" value="0x1"/>
         <value caption="This bit always reads 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Forced Transfer bit" name="DCH5ECON__CFORCE">
         <value caption="A DMA transfer is forced to begin when this bit is written to a 1" name="" value="0x1"/>
         <value caption="This bit always reads 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Transfer Start IRQ bits" name="DCH5ECON__CHSIRQ">
         <value caption="Interrupt 255 will initiate a DMA transfer" name="" value="0xff"/>
         <value caption="Interrupt 1 will initiate a DMA transfer" name="" value="0x1"/>
         <value caption="Interrupt 0 will initiate a DMA transfer" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Transfer Abort IRQ bits" name="DCH5ECON__CHAIRQ">
         <value caption="Interrupt 255 will abort any transfers in progress and set CHAIF flag" name="" value="0xff"/>
         <value caption="Interrupt 1 will abort any transfers in progress and set CHAIF flag" name="" value="0x1"/>
         <value caption="Interrupt 0 will abort any transfers in progress and set CHAIF flag" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Abort IRQ Enable bit" name="DCH6ECON__AIRQEN">
         <value caption="Channel transfer is aborted if an interrupt matching CHAIRQ occurs" name="" value="0x1"/>
         <value caption="Interrupt number CHAIRQ is ignored and does not terminate a transfer" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Start IRQ Enable bit" name="DCH6ECON__SIRQEN">
         <value caption="Start channel cell transfer if an interrupt matching CHSIRQ occurs" name="" value="0x1"/>
         <value caption="Interrupt number CHSIRQ is ignored and does not start a transfer" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Pattern Match Abort Enable bit" name="DCH6ECON__PATEN">
         <value caption="Abort transfer and clear CHEN on pattern match" name="" value="0x1"/>
         <value caption="Pattern match is disabled" name="" value="0x0"/>
      </value-group>
