Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ2048EFG064.atdf
      <value-group caption="SPI Receive Buffer Full Interrupt Mode bits" name="SPI4CON__SRXISEL">
         <value caption="Interrupt is generated when the buffer is full" name="" value="0x3"/>
         <value caption="Interrupt is generated when the buffer is full by one-half or more" name="" value="0x2"/>
         <value caption="Interrupt is generated when the buffer is not empty" name="" value="0x1"/>
         <value caption="Interrupt is generated when the last word in the receive buffer is read (i.e. buffer is empty)" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Transmit Buffer Empty Interrupt Mode bits" name="SPI4CON__STXISEL">
         <value caption="Interrupt is generated when the buffer is not full (has one or more empty elements)" name="" value="0x3"/>
         <value caption="Interrupt is generated when the buffer is empty by one-half or more" name="" value="0x2"/>
         <value caption="Interrupt is generated when the buffer is completely empty" name="" value="0x1"/>
         <value caption="Interrupt is generated when the last transfer is shifted out of SPISR and transmit operations are complete" name="" value="0x0"/>
      </value-group>
      <value-group caption="Disable SDI bit" name="SPI4CON__DISSDI">
         <value caption="SDI pin is not used by the SPI module (pin is controlled by PORT function)" name="" value="0x1"/>
         <value caption="SDI pin is controlled by the SPI module" name="" value="0x0"/>
      </value-group>
      <value-group caption="Master Mode Enable bit" name="SPI4CON__MSTEN">
         <value caption="Master mode" name="" value="0x1"/>
         <value caption="Slave mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Clock Polarity Select bit" name="SPI4CON__CKP">
         <value caption="Idle state for clock is a high level; active state is a low level" name="" value="0x1"/>
         <value caption="Idle state for clock is a low level; active state is a high level" name="" value="0x0"/>
      </value-group>
      <value-group caption="Slave Select Enable bit" name="SPI4CON__SSEN">
         <value caption="SSx pin used for Slave mode" name="" value="0x1"/>
         <value caption="SSx pin not used for Slave mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Clock Edge Select bit" name="SPI4CON__CKE">
         <value caption="Serial output data changes on transition from active clock state to Idle clock state (see CKP bit)" name="" value="0x1"/>
         <value caption="Serial output data changes on transition from Idle clock state to active clock state (see CKP bit)" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Data Input Sample Phase bit (master mode only)" name="SPI4CON__SMP">
         <value caption="(Master mode) Input data sampled at end of data output time / (Slave mode) value is ignored" name="" value="0x1"/>
         <value caption="(Master mode) Input data sampled at middle of data output time / (Slave mode) value is ignored" name="" value="0x0"/>
      </value-group>
      <value-group caption="Disable SDOx pin bit" name="SPI4CON__DISSDO">
         <value caption="SDOx pin is not used by the module. Pin is controlled by associated PORT register" name="" value="0x1"/>
         <value caption="SDOx pin is controlled by the module" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="SPI4CON__SIDL">
         <value caption="Discontinue operation when CPU enters in Idle mode" name="" value="0x1"/>
         <value caption="Continue operation in Idle mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI/I 2 S Module On bit" name="SPI4CON__ON">
         <value caption="SPI/I2S module is enabled" name="" value="0x1"/>
         <value caption="SPI/I2S module is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enhanced Buffer Enable bit" name="SPI4CON__ENHBUF">
         <value caption="Enhanced Buffer mode is enabled" name="" value="0x1"/>
         <value caption="Enhanced Buffer mode is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Frame Sync Pulse Edge Select bit" name="SPI4CON__SPIFE">
         <value caption="Frame synchronization pulse coincides with the first bit clock" name="" value="0x1"/>
         <value caption="Frame synchronization pulse precedes the first bit clock" name="" value="0x0"/>
      </value-group>
      <value-group caption="Master Clock Enable bit" name="SPI4CON__MCLKSEL">
         <value caption="REFCLKO1 is used by the Baud Rate Generator" name="" value="0x1"/>
         <value caption="PBCLK2 is used by the Baud Rate Generator" name="" value="0x0"/>
      </value-group>
      <value-group caption="Frame Sync Pulse Counter bits. Controls the number of data characters transmitted per pulse. This bit is only valid in Framed mode." name="SPI4CON__FRMCNT">
         <value caption="Reserved" name="" value="0x7"/>
         <value caption="Reserved" name="" value="0x6"/>
         <value caption="Generate a frame sync pulse on every 32 data characters" name="" value="0x5"/>
         <value caption="Generate a frame sync pulse on every 16 data characters" name="" value="0x4"/>
         <value caption="Generate a frame sync pulse on every 8 data characters" name="" value="0x3"/>
         <value caption="Generate a frame sync pulse on every 4 data characters" name="" value="0x2"/>
         <value caption="Generate a frame sync pulse on every 2 data characters" name="" value="0x1"/>
         <value caption="Generate a frame sync pulse on every data character" name="" value="0x0"/>
      </value-group>
      <value-group caption="Frame Sync Pulse Width bit" name="SPI4CON__FRMSYPW">
         <value caption="Frame sync pulse is one character wide" name="" value="0x1"/>
         <value caption="Frame sync pulse is one clock wide" name="" value="0x0"/>
      </value-group>
      <value-group caption="Master Mode Slave Select Enable bit" name="SPI4CON__MSSEN">
         <value caption="Slave select SPI support enabled. The SS pin is automatically driven during transmission in Master mode. Polarity is determined by the FRMPOL bit." name="" value="0x1"/>
         <value caption="Slave select SPI support is disabled." name="" value="0x0"/>
      </value-group>
      <value-group caption="Frame Sync Polarity bit" name="SPI4CON__FRMPOL">
         <value caption="Frame pulse is active-high" name="" value="0x1"/>
         <value caption="Frame pulse is active-low" name="" value="0x0"/>
      </value-group>
      <value-group caption="Frame Sync Pulse Direction Control on SSx pin bit" name="SPI4CON__FRMSYNC">
         <value caption="Frame sync pulse input (Slave mode)" name="" value="0x1"/>
         <value caption="Frame sync pulse output (Master mode)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Framed SPI Support bit" name="SPI4CON__FRMEN">
         <value caption="Framed SPI support is enabled (SSx pin used as FSYNC input/output)" name="" value="0x1L"/>
         <value caption="Framed SPI support is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Receive Buffer Full Status bit" name="SPI1STAT__SPIRBF">
         <value caption="Receive buffer" name="" value="0x1"/>
         <value caption="Receive buffer" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Transmit Buffer Full Status bit" name="SPI1STAT__SPITBF">
         <value caption="Transmit not yet started" name="" value="0x1"/>
         <value caption="Transmit buffer is not full" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Transmit Buffer Empty Status bit" name="SPI1STAT__SPITBE">
         <value caption="Transmit buffer" name="" value="0x1"/>
         <value caption="Transmit buffer" name="" value="0x0"/>
      </value-group>
      <value-group caption="RX FIFO Empty bit (valid only when ENHBUF = 1)" name="SPI1STAT__SPIRBE">
         <value caption="RX FIFO is empty (CRPTR = SWPTR)" name="" value="0x1"/>
         <value caption="RX FIFO is not empty (CRPTR ? SWPTR)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Overflow Flag bit" name="SPI1STAT__SPIROV">
         <value caption="A new data is completely received and discarded. The user software has not read the previous data in the SPIxBUF register." name="" value="0x1"/>
         <value caption="No overflow has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Shift Register Empty bit" name="SPI1STAT__SRMT">
         <value caption="When SPI module shift register is empty" name="" value="0x1"/>
         <value caption="When SPI module shift register is not empty" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Under Run bit" name="SPI1STAT__SPITUR">
         <value caption="Transmit buffer has encountered an underrun condition" name="" value="0x1"/>
         <value caption="Transmit buffer has no underrun condition" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Activity Status bit" name="SPI1STAT__SPIBUSY">
         <value caption="SPI peripheral is currently busy with some transactions" name="" value="0x1"/>
         <value caption="SPI peripheral is currently idle" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Frame Error status bit" name="SPI1STAT__FRMERR">
         <value caption="Frame error detected" name="" value="0x1"/>
         <value caption="No Frame error detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Receive Buffer Full Status bit" name="SPI2STAT__SPIRBF">
         <value caption="Receive buffer" name="" value="0x1"/>
         <value caption="Receive buffer" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Transmit Buffer Full Status bit" name="SPI2STAT__SPITBF">
         <value caption="Transmit not yet started" name="" value="0x1"/>
         <value caption="Transmit buffer is not full" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Transmit Buffer Empty Status bit" name="SPI2STAT__SPITBE">
         <value caption="Transmit buffer" name="" value="0x1"/>
         <value caption="Transmit buffer" name="" value="0x0"/>
      </value-group>
